IlleniumDillon/MM32F5277/PinMap/MM32_SPI_PinMap.c
#include "MM32_SPI_PinMap.h"

MM32_SPI_Pin SPI1_NSS_PA4   = {.periBase = SPI1, .port = GPIOA, .pin = P04, .af = AF05};
MM32_SPI_Pin SPI1_SCK_PA5   = {.periBase = SPI1, .port = GPIOA, .pin = P05, .af = AF05};
MM32_SPI_Pin SPI1_MISO_PA6  = {.periBase = SPI1, .port = GPIOA, .pin = P06, .af = AF05};
MM32_SPI_Pin SPI1_MOSI_PA7  = {.periBase = SPI1, .port = GPIOA, .pin = P07, .af = AF05};
MM32_SPI_Pin SPI1_NSS_PA15  = {.periBase = SPI1, .port = GPIOA, .pin = P15, .af = AF05};

MM32_SPI_Pin SPI1_SCK_PB3   = {.periBase = SPI1, .port = GPIOB, .pin = P03, .af = AF05};
MM32_SPI_Pin SPI1_MISO_PB4  = {.periBase = SPI1, .port = GPIOB, .pin = P04, .af = AF05};
MM32_SPI_Pin SPI1_MOSI_PB5  = {.periBase = SPI1, .port = GPIOB, .pin = P05, .af = AF05};
MM32_SPI_Pin SPI1_NSS_PB6   = {.periBase = SPI1, .port = GPIOB, .pin = P06, .af = AF05};

MM32_SPI_Pin SPI1_NSS_PE11  = {.periBase = SPI1, .port = GPIOE, .pin = P11, .af = AF05};
MM32_SPI_Pin SPI1_SCK_PE12  = {.periBase = SPI1, .port = GPIOE, .pin = P12, .af = AF05};
MM32_SPI_Pin SPI1_MISO_PE13 = {.periBase = SPI1, .port = GPIOE, .pin = P13, .af = AF05};
MM32_SPI_Pin SPI1_MOSI_PE14 = {.periBase = SPI1, .port = GPIOE, .pin = P14, .af = AF05};

MM32_SPI_Pin SPI1_NSS_PF6   = {.periBase = SPI1, .port = GPIOF, .pin = P06, .af = AF05};
MM32_SPI_Pin SPI1_SCK_PF7   = {.periBase = SPI1, .port = GPIOF, .pin = P07, .af = AF05};
MM32_SPI_Pin SPI1_MISO_PF8  = {.periBase = SPI1, .port = GPIOF, .pin = P08, .af = AF05};
MM32_SPI_Pin SPI1_MOSI_PF9  = {.periBase = SPI1, .port = GPIOF, .pin = P09, .af = AF05};
MM32_SPI_Pin SPI1_MOSI_PF11 = {.periBase = SPI1, .port = GPIOF, .pin = P11, .af = AF05};

MM32_SPI_Pin SPI2_NSS_PB9   = {.periBase = SPI2, .port = GPIOB, .pin = P09, .af = AF05};
MM32_SPI_Pin SPI2_SCK_PB10  = {.periBase = SPI2, .port = GPIOB, .pin = P10, .af = AF05};
MM32_SPI_Pin SPI2_NSS_PB12  = {.periBase = SPI2, .port = GPIOB, .pin = P12, .af = AF05};
MM32_SPI_Pin SPI2_SCK_PB13  = {.periBase = SPI2, .port = GPIOB, .pin = P13, .af = AF05};
MM32_SPI_Pin SPI2_MISO_PB14 = {.periBase = SPI2, .port = GPIOB, .pin = P14, .af = AF05};
MM32_SPI_Pin SPI2_MOSI_PB15 = {.periBase = SPI2, .port = GPIOB, .pin = P15, .af = AF05};

MM32_SPI_Pin SPI2_MISO_PC2  = {.periBase = SPI2, .port = GPIOC, .pin = P02, .af = AF05};
MM32_SPI_Pin SPI2_MOSI_PC3  = {.periBase = SPI2, .port = GPIOC, .pin = P03, .af = AF05};
MM32_SPI_Pin SPI2_MISO_PC6  = {.periBase = SPI2, .port = GPIOC, .pin = P06, .af = AF05};

MM32_SPI_Pin SPI2_SCK_PD3   = {.periBase = SPI2, .port = GPIOD, .pin = P03, .af = AF05};

MM32_SPI_Pin SPI2_SCK_PE2   = {.periBase = SPI2, .port = GPIOE, .pin = P02, .af = AF05};
MM32_SPI_Pin SPI2_NSS_PE3   = {.periBase = SPI2, .port = GPIOE, .pin = P03, .af = AF05};
MM32_SPI_Pin SPI2_NSS_PE4   = {.periBase = SPI2, .port = GPIOE, .pin = P04, .af = AF05};
MM32_SPI_Pin SPI2_MISO_PE5  = {.periBase = SPI2, .port = GPIOE, .pin = P05, .af = AF05};
MM32_SPI_Pin SPI2_MOSI_PE6  = {.periBase = SPI2, .port = GPIOE, .pin = P06, .af = AF05};

MM32_SPI_Pin SPI2_NSS_PF0   = {.periBase = SPI2, .port = GPIOF, .pin = P00, .af = AF05};
MM32_SPI_Pin SPI2_SCK_PF1   = {.periBase = SPI2, .port = GPIOF, .pin = P01, .af = AF05};

MM32_SPI_Pin SPI2_NSS_PG8   = {.periBase = SPI2, .port = GPIOG, .pin = P08, .af = AF05};
MM32_SPI_Pin SPI2_MISO_PG12 = {.periBase = SPI2, .port = GPIOG, .pin = P12, .af = AF05};
MM32_SPI_Pin SPI2_SCK_PG13  = {.periBase = SPI2, .port = GPIOG, .pin = P13, .af = AF05};
MM32_SPI_Pin SPI2_MOSI_PG14 = {.periBase = SPI2, .port = GPIOG, .pin = P14, .af = AF05};

MM32_SPI_Pin SPI3_NSS_PA4   = {.periBase = SPI3, .port = GPIOA, .pin = P04, .af = AF06};
MM32_SPI_Pin SPI3_NSS_PA15  = {.periBase = SPI3, .port = GPIOA, .pin = P15, .af = AF06};

MM32_SPI_Pin SPI3_SCK_PB3   = {.periBase = SPI3, .port = GPIOB, .pin = P03, .af = AF06};
MM32_SPI_Pin SPI3_MISO_PB4  = {.periBase = SPI3, .port = GPIOB, .pin = P04, .af = AF06};
MM32_SPI_Pin SPI3_MOSI_PB5  = {.periBase = SPI3, .port = GPIOB, .pin = P05, .af = AF06};
MM32_SPI_Pin SPI3_NSS_PB6   = {.periBase = SPI3, .port = GPIOB, .pin = P06, .af = AF06};

MM32_SPI_Pin SPI3_MISO_PC7  = {.periBase = SPI3, .port = GPIOC, .pin = P07, .af = AF05};
MM32_SPI_Pin SPI3_MISO_PC7_ = {.periBase = SPI3, .port = GPIOC, .pin = P07, .af = AF06};
MM32_SPI_Pin SPI3_SCK_PC10  = {.periBase = SPI3, .port = GPIOC, .pin = P10, .af = AF06};
MM32_SPI_Pin SPI3_MISO_PC11 = {.periBase = SPI3, .port = GPIOC, .pin = P11, .af = AF06};
MM32_SPI_Pin SPI3_MOSI_PC12 = {.periBase = SPI3, .port = GPIOC, .pin = P12, .af = AF06};

MM32_SPI_Pin SPI3_SCK_PD4   = {.periBase = SPI3, .port = GPIOD, .pin = P04, .af = AF05};
MM32_SPI_Pin SPI3_MISO_PD5  = {.periBase = SPI3, .port = GPIOD, .pin = P05, .af = AF05};
MM32_SPI_Pin SPI3_MOSI_PD6  = {.periBase = SPI3, .port = GPIOD, .pin = P06, .af = AF05};
MM32_SPI_Pin SPI3_NSS_PD7   = {.periBase = SPI3, .port = GPIOD, .pin = P07, .af = AF05};
MM32_SPI_Pin SPI3_SCK_PD12  = {.periBase = SPI3, .port = GPIOD, .pin = P12, .af = AF06};
MM32_SPI_Pin SPI3_MISO_PD13 = {.periBase = SPI3, .port = GPIOD, .pin = P13, .af = AF06};
MM32_SPI_Pin SPI3_MOSI_PD14 = {.periBase = SPI3, .port = GPIOD, .pin = P14, .af = AF06};
MM32_SPI_Pin SPI3_NSS_PD15  = {.periBase = SPI3, .port = GPIOD, .pin = P15, .af = AF06};